# parameters
nc: 10  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, GhostConv, [32, 3, 1]],  # 0
   [-1, 1, GhostConv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 2]],  # 3-P2/4

# elan 1
#==========================
   [-1, 1, ConvNextBlock, [128]],    # 4
#==========================

   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 9

# elan 2
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 17

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 22

# elan 3
   [-1, 1, GhostConv, [256, 1, 1]],
   [-2, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [1024, 1, 1]],  # 30

   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 35

   #==========================
   [-1, 1, ConvNextBlock, [1024]],    # 36
    #==========================
  ]

# yolov7 head
head:
  [
   [-1, 1, Conv, [1024, 1, 1]],  # 37
   [-1, 1, CBAM, [1024, 1]],  # 38
   [-1, 1, SPPCSPC, [512]], # 39

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [30, 1, Conv, [256, 1, 1]], # route backbone P4(O)
   [-1, 1, CBAM, [256, 1]],  # 43
   [[-1, -3], 1, Concat, [1]],

# elan 5
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 52

   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [17, 1, Conv, [128, 1, 1]], # route backbone P3(O)
   [-1, 1, CBAM, [128, 1]],  # 56
   [[-1, -3], 1, Concat, [1]],

# elan 6
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 65

   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 52], 1, Concat, [1]],

# elan 7
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 78

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3, 39], 1, Concat, [1]],

# elan 8
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 91

   [65, 1, RepConv, [256, 3, 1]],    # 92
   [78, 1, RepConv, [512, 3, 1]],    # 93
   [91, 1, RepConv, [1024, 3, 1]],  # 94

   [[92,93,94], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
