# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [
   [-1, 1, GhostConv, [32, 3, 1]],  # 0
   [-1, 1, GhostConv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 2]],  # 3-P2/4

# ELAN 1
   [-1, 1, GhostConv, [64, 1, 1]],
   [-2, 1, GhostConv, [64, 1, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [256, 1, 1]],  # 11
   [-1, 1, CBAM, [256, 1]],

# MP 1
   [-1, 1, MP, []],
   [-1, 1, GhostConv, [128, 1, 1]],
   [-3, 1, GhostConv, [128, 1, 1]],
   [-1, 1, GhostConv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8

# ELAN 2
   [-1, 1, GhostConv, [128, 1, 1]],
   [-2, 1, GhostConv, [128, 1, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [512, 1, 1]],  # 25
   [-1, 1, CBAM, [512, 1]],

# MP 2
   [-1, 1, MP, []],
   [-1, 1, GhostConv, [256, 1, 1]],
   [-3, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16

# ELAN 3
   [-1, 1, GhostConv, [256, 1, 1]],
   [-2, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [1024, 1, 1]],  # 39
   [-1, 1, CBAM, [1024, 1]],

# MP 3
   [-1, 1, MP, []],
   [-1, 1, GhostConv, [512, 1, 1]],
   [-3, 1, GhostConv, [512, 1, 1]],
   [-1, 1, GhostConv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 42-P5/32

# ELAN 4
   [-1, 1, GhostConv, [256, 1, 1]],
   [-2, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [1024, 1, 1]],  # 53
   [-1, 1, CBAM, [1024, 1]]
  ]

# yolov7 head
head:
  [
   [-1, 1, SPPCSPC, [512]], # 55
   [-1, 1, GhostConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [39, 1, GhostConv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],

# ELAN 5
   [-1, 1, GhostConv, [256, 1, 1]],
   [-2, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [256, 1, 1]], # 67
   
   [-1, 1, GhostConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [25, 1, GhostConv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],

# ELAN 6
   [-1, 1, GhostConv, [128, 1, 1]],
   [-2, 1, GhostConv, [128, 1, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [-1, 1, GhostConv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [128, 1, 1]], # 79
      
   [-1, 1, MP, []],
   [-1, 1, GhostConv, [128, 1, 1]],
   [-3, 1, GhostConv, [128, 1, 1]],
   [-1, 1, GhostConv, [128, 3, 2]],
   [[-1, -3, 63], 1, Concat, [1]],

# ELAN 7
   [-1, 1, GhostConv, [256, 1, 1]],
   [-2, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [-1, 1, GhostConv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [256, 1, 1]], # 92
      
   [-1, 1, MP, []],
   [-1, 1, GhostConv, [256, 1, 1]],
   [-3, 1, GhostConv, [256, 1, 1]],
   [-1, 1, GhostConv, [256, 3, 2]],
   [[-1, -3, 51], 1, Concat, [1]],

# ELAN 8
   [-1, 1, GhostConv, [512, 1, 1]],
   [-2, 1, GhostConv, [512, 1, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [-1, 1, GhostConv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, GhostConv, [512, 1, 1]], # 105
   
   [75, 1, RepConv, [256, 3, 1]],
   [88, 1, RepConv, [512, 3, 1]],
   [101, 1, RepConv, [1024, 3, 1]],

   [[102,103,104], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
